ITEST/itest.WebService/test-resources/EPBDS-7947/validation_onBrandCode_shouldBeFailed.req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:checkValidation xmlns:ns1="http://DefaultNamespace">
            <ns1:policy xmlns:ns2="http://beans.generated.openl.org"
                        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                        xsi:type="ns2:Policy">
                <ns2:brandCodes>
                    <ns1:int>10</ns1:int>
                    <ns1:int>100</ns1:int>
                    <ns1:int>30</ns1:int>
                </ns2:brandCodes>
                <ns2:id>b0506af2-c8e0-4c6e-a20c-d9ff7a912a47</ns2:id>
                <ns2:paymentMatrix>
                    <ns2:ArrayOfPaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                    </ns2:ArrayOfPaymentPlan>
                    <ns2:ArrayOfPaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                    </ns2:ArrayOfPaymentPlan>
                    <ns2:ArrayOfPaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                        <ns2:PaymentPlan xsi:type="ns2:PaymentPlan">
                            <ns2:name>ANNUAL</ns2:name>
                        </ns2:PaymentPlan>
                    </ns2:ArrayOfPaymentPlan>
                </ns2:paymentMatrix>
                <ns2:transaction>NEW_BUSINESS</ns2:transaction>
                <ns2:vehicles>
                    <ns2:Vehicle xsi:type="ns2:Vehicle">
                        <ns2:coverages>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV1</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV2</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV3</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV4</ns2:name>
                            </ns2:Coverage>
                        </ns2:coverages>
                        <ns2:driver xsi:type="ns2:Driver">
                            <ns2:birthDate>2019-12-09T21:42:55.569+03:00</ns2:birthDate>
                            <ns2:gender>male</ns2:gender>
                        </ns2:driver>
                        <ns2:id>5b42db84-393d-400d-98f4-c43c21a306c6</ns2:id>
                    </ns2:Vehicle>
                    <ns2:Vehicle xsi:type="ns2:Vehicle">
                        <ns2:coverages>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV1</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV2</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV3</ns2:name>
                            </ns2:Coverage>
                            <ns2:Coverage xsi:type="ns2:Coverage">
                                <ns2:name>COV4</ns2:name>
                            </ns2:Coverage>
                        </ns2:coverages>
                        <ns2:driver xsi:type="ns2:Driver">
                            <ns2:birthDate>2019-12-09T21:42:55.569+03:00</ns2:birthDate>
                            <ns2:gender>male</ns2:gender>
                        </ns2:driver>
                        <ns2:id>b5b2ac8a-774a-4f04-a0af-a0092a41f4e7</ns2:id>
                    </ns2:Vehicle>
                </ns2:vehicles>
            </ns1:policy>
        </ns1:checkValidation>
    </soap:Body>
</soap:Envelope>